# CancelConnectedFaceSet Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilder..::..CancelConnectedFaceSet Method
TessellatedShapeBuilder Class See Also
---
Cancels the current face set - i.e., all data from it will be lost and the builder will have no open connected face set anymore.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void CancelConnectedFaceSet()
```

Visual Basic
---
```text
Public Sub CancelConnectedFaceSet
```

Visual C++
---
```text
public:
void CancelConnectedFaceSet()
```

# Remarks
This function can be safely called upon builder without an open face set.
# See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace